"""
需求：有一份账单文件，记录了消费收入的具体记录，内容如下：
name,date,money,type,remarks
周杰轮,2022-01-01,100000,消费,正式
周杰轮,2022-01-02,300000,收入,正式
周杰轮,2022-01-03,100000,消费,测试
林俊节,2022-01-01,300000,收入,正式
林俊节,2022-01-02,100000,消费,测试
林俊节,2022-01-03,100000,消费,正式
林俊节,2022-01-04,100000,消费,测试
林俊节,2022-01-05,500000,收入,正式
张学油,2022-01-01,100000,消费,正式
张学油,2022-01-02,500000,收入,正式
张学油,2022-01-03,900000,收入,测试
王力鸿,2022-01-01,500000,消费,正式
王力鸿,2022-01-02,300000,消费,测试
王力鸿,2022-01-03,950000,收入,正式
刘德滑,2022-01-01,300000,消费,测试
刘德滑,2022-01-02,100000,消费,正式
刘德滑,2022-01-03,300000,消费,正式
同学们可以将内容复制并保存为 bill.txt文件

我们现在要做的就是：
读取文件
将文件写出到bill.txt.bak文件作为备份
同时，将文件内标记为测试的数据行丢弃
"""
# 1. 打开文件
content = open('bill.txt', 'r', encoding='utf-8').readlines()
# 2. 调整文件内容，将将文件内标记为测试的数据行丢弃
# content = [i for i in content if '测试' not in i]
for i in content:
    if '测试' in i:
        content.remove(i)
# 3. 写入文件
with open('bill.txt.bak', 'w', encoding='utf-8') as f:
    f.writelines(content)
